In [388]:
import pandas as pd
import numpy as np

In [389]:
df=pd.read_csv("Book1.csv")

In [390]:
cols=["age","salary"]

In [391]:
print(df.isna().sum())

age       2
salary    3
city      0
dtype: int64

In [392]:
print(df.isna().mean()*100)

age        9.523810
salary    14.285714
city       0.000000
dtype: float64

In [393]:
df.replace(np.nan,np.nan,inplace=True)

In [394]:
missing_vals=df[df.isna().any(axis=1)]
print(missing_vals)

     age  salary       city
2   25.0     NaN      Delhi
6    NaN  7887.0     Mumbai
10  41.0     NaN     Mumbai
12   NaN     NaN  Bangalore

In [395]:
from sklearn.impute import SimpleImputer

In [396]:
from sklearn.impute import KNNImputer

In [397]:
knn_imputer=KNNImputer(n_neighbors=5)
df[cols]=knn_imputer.fit_transform(df[cols])

In [ ]:
imp_mean=SimpleImputer(missing_values=np.nan,strategy="mean")
df[cols]=imp_mean.fit_transform(df[cols])

In [399]:
df

          age       salary       city
0   23.000000  2000.000000      Delhi
1   32.000000  4533.000000     Mumbai
2   25.000000  3071.600000      Delhi
3   27.000000  4355.000000      Delhi
4   34.000000  1568.000000     Mumbai
5   56.000000  2890.000000      Delhi
6   59.000000  7887.000000     Mumbai
7   45.000000  8965.000000     Mumbai
8   28.000000  5657.000000     Mumbai
9   34.000000  6546.000000      Delhi
10  41.000000  5187.000000     Mumbai
11  53.000000  9657.000000      Delhi
12  39.368421  4482.333333  Bangalore
13  76.000000  6545.000000      Delhi
14  23.000000  2345.000000     Mumbai
15  12.000000     0.000000      Delhi
16  10.000000     0.000000     Mumbai
17  19.000000  1001.000000      Delhi
18  87.000000  8986.000000      Delhi
19  45.000000  4323.000000     Mumbai
20  78.000000  3424.000000     Mumbai

In [400]:
city=["Delhi","Mumbai","Delhi"]

In [401]:
df_encoded=pd.get_dummies(df,columns=["city"])

In [402]:
from sklearn.preprocessing import OneHotEncoder

In [403]:
encoder=OneHotEncoder(handle_unknown="ignore",sparse_output=False)
encoded=encoder.fit_transform(df[["city"]])
encoded_df=pd.DataFrame(encoded,columns=encoder.get_feature_names_out(["city"]))
df=pd.concat([df.drop(columns=["city"]),encoded_df],axis=1)

In [404]:
df

          age       salary  city_Bangalore  city_Delhi  city_Mumbai
0   23.000000  2000.000000             0.0         1.0          0.0
1   32.000000  4533.000000             0.0         0.0          1.0
2   25.000000  3071.600000             0.0         1.0          0.0
3   27.000000  4355.000000             0.0         1.0          0.0
4   34.000000  1568.000000             0.0         0.0          1.0
5   56.000000  2890.000000             0.0         1.0          0.0
6   59.000000  7887.000000             0.0         0.0          1.0
7   45.000000  8965.000000             0.0         0.0          1.0
8   28.000000  5657.000000             0.0         0.0          1.0
9   34.000000  6546.000000             0.0         1.0          0.0
10  41.000000  5187.000000             0.0         0.0          1.0
11  53.000000  9657.000000             0.0         1.0          0.0
12  39.368421  4482.333333             1.0         0.0          0.0
13  76.000000  6545.000000             0.0         1.0          0.0
14  23.000000  2345.000000             0.0         0.0          1.0
15  12.000000     0.000000             0.0         1.0          0.0
16  10.000000     0.000000             0.0         0.0          1.0
17  19.000000  1001.000000             0.0         1.0          0.0
18  87.000000  8986.000000             0.0         1.0          0.0
19  45.000000  4323.000000             0.0         0.0          1.0
20  78.000000  3424.000000             0.0         0.0          1.0

In [405]:
df

          age       salary  city_Bangalore  city_Delhi  city_Mumbai
0   23.000000  2000.000000             0.0         1.0          0.0
1   32.000000  4533.000000             0.0         0.0          1.0
2   25.000000  3071.600000             0.0         1.0          0.0
3   27.000000  4355.000000             0.0         1.0          0.0
4   34.000000  1568.000000             0.0         0.0          1.0
5   56.000000  2890.000000             0.0         1.0          0.0
6   59.000000  7887.000000             0.0         0.0          1.0
7   45.000000  8965.000000             0.0         0.0          1.0
8   28.000000  5657.000000             0.0         0.0          1.0
9   34.000000  6546.000000             0.0         1.0          0.0
10  41.000000  5187.000000             0.0         0.0          1.0
11  53.000000  9657.000000             0.0         1.0          0.0
12  39.368421  4482.333333             1.0         0.0          0.0
13  76.000000  6545.000000             0.0         1.0          0.0
14  23.000000  2345.000000             0.0         0.0          1.0
15  12.000000     0.000000             0.0         1.0          0.0
16  10.000000     0.000000             0.0         0.0          1.0
17  19.000000  1001.000000             0.0         1.0          0.0
18  87.000000  8986.000000             0.0         1.0          0.0
19  45.000000  4323.000000             0.0         0.0          1.0
20  78.000000  3424.000000             0.0         0.0          1.0

In [406]:
from sklearn.preprocessing import OrdinalEncoder

In [407]:
df2=pd.DataFrame({"size":["small","medium","large"]})
enc=OrdinalEncoder(categories=[["small","medium","large"]])
df2=enc.fit_transform(df2[["size"]])

In [408]:
df2

array([[0.],
       [1.],
       [2.]])